#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.eks.module.eks_managed_node_group["management"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.irsa_aws_load_balancer_controller.data.aws_caller_identity.current: Reading...
module.irsa_cert_manager.data.aws_caller_identity.current: Reading...
module.irsa_aws_load_balancer_controller.data.aws_partition.current: Reading...
module.irsa_cert_manager.data.aws_partition.current: Reading...
aws_iam_policy.aws_load_balancer_controller: Refreshing state... [id=arn:aws:iam::975050034278:policy/demo-eks-cluster-aws-load-balancer-controller-policy]
module.irsa_aws_load_balancer_controller.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.eks_managed_node_group["management"].data.aws_partition.current: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.irsa_cert_manager.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["management"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["management"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
data.aws_availability_zones.available: Reading...
module.eks.data.aws_caller_identity.current: Reading...
data.aws_route53_zone.zone: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["management"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0069d3d34a34db803]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=demo-eks-cluster-cluster-20240518102356886900000002]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=975050034278]
module.eks.module.eks_managed_node_group["management"].aws_iam_role.this[0]: Refreshing state... [id=management-eks-node-group-20240518102356886300000001]
module.irsa_aws_load_balancer_controller.data.aws_caller_identity.current: Read complete after 0s [id=975050034278]
module.irsa_cert_manager.data.aws_caller_identity.current: Read complete after 1s [id=975050034278]
module.eks.module.eks_managed_node_group["management"].data.aws_caller_identity.current: Read complete after 1s [id=975050034278]
module.eks.data.aws_caller_identity.current: Read complete after 1s [id=975050034278]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::975050034278:user/tech_user]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
data.aws_route53_zone.zone: Read complete after 1s [id=Z091966067WXBVR2EU8U]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=demo-eks-cluster-cluster-20240518102356886900000002-20240518102357256700000005]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=demo-eks-cluster-cluster-20240518102356886900000002-20240518102357241700000004]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=4217504900]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=7b3ad1a4-e31f-422a-afd6-c696553dcfad]
module.eks.module.eks_managed_node_group["management"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=management-eks-node-group-20240518102356886300000001-20240518102357402400000007]
module.eks.module.eks_managed_node_group["management"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=management-eks-node-group-20240518102356886300000001-20240518102357207300000003]
module.eks.module.eks_managed_node_group["management"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=management-eks-node-group-20240518102356886300000001-20240518102357298300000006]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/demo-eks-cluster]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::975050034278:policy/demo-eks-cluster-cluster-ClusterEncryption2024051810241830210000000d]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0054c154e8568fd88]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-00a7d3d4873fa0a4c]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0a11cbe8bac529109]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-049e550aa1329132c]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0abd485792c9a2768]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0a6bd46426cb78ee0]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0882278a4c41098b9]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0ef83b72fef4f4985]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0c4505192ceeae253]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0c2d6d0a108762d40]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0eaea65388064b756]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0d3732b7b01bf62e7]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-07e0fb6cdabd4470e]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0b03e429cf38edf5e]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=demo-eks-cluster-cluster-20240518102356886900000002-2024051810241851350000000e]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0bec3f0bbed53bede]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-039ad974ab28480d9]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b387aa03c4f944f5]
module.eks.aws_security_group_rule.node["ingress_self_all"]: Refreshing state... [id=sgrule-1935263883]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2502863384]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-824626821]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3946353970]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3177255635]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3489000789]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2837402549]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-4167346451]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2409211641]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-829491703]
module.eks.aws_security_group_rule.node["ingress_allow_access_from_control_plane"]: Refreshing state... [id=sgrule-3710343694]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-4020150627]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-2455161250]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0e11430446fbfd0e1]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03b65bfcf96be8d03]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0386e218e9fde4ad1]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-07e0fb6cdabd4470e1080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ecb53039250b4c49]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=demo-eks-cluster]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-030c48654b411853d]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0a6bd46426cb78ee01080289494]
module.eks.aws_ec2_tag.cluster_primary_security_group["K8s Description"]: Refreshing state... [id=sg-088c2cc851cd8e884,K8s Description]
module.eks.aws_ec2_tag.cluster_primary_security_group["Type"]: Refreshing state... [id=sg-088c2cc851cd8e884,Type]
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-05-18T10:34:23Z]
module.eks.data.tls_certificate.this[0]: Reading...
module.irsa_aws_load_balancer_controller.data.aws_iam_policy_document.assume_role_with_oidc[0]: Reading...
module.irsa_aws_load_balancer_controller.data.aws_iam_policy_document.assume_role_with_oidc[0]: Read complete after 0s [id=2783315757]
module.irsa_cert_manager.data.aws_iam_policy_document.assume_role_with_oidc[0]: Reading...
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.irsa_cert_manager.data.aws_iam_policy_document.assume_role_with_oidc[0]: Read complete after 0s [id=1877460012]
module.irsa_aws_load_balancer_controller.aws_iam_role.this[0]: Refreshing state... [id=demo-eks-cluster-aws-load-balancer-controller-role]
module.eks.module.eks_managed_node_group["management"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=3067068327426725068]
module.eks.module.eks_managed_node_group["management"].aws_launch_template.this[0]: Refreshing state... [id=lt-01374432ea92f4559]
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=d82ec4c4871b30057e4fdc5168bb427f80ad4166]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::975050034278:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/9AD4B3D82B4B0B91991A3CF4B9B9008B]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.module.eks_managed_node_group["management"].aws_eks_node_group.this[0]: Refreshing state... [id=demo-eks-cluster:management-20240518103424218400000011]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.irsa_aws_load_balancer_controller.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=demo-eks-cluster-aws-load-balancer-controller-role-20240518125918933800000001]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=demo-eks-cluster:kube-proxy]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=demo-eks-cluster:vpc-cni]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=demo-eks-cluster:coredns]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.cert_manager will be created
  + resource "aws_iam_policy" "cert_manager" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "EKS AWS Cert Manager policy for cluster demo-eks-cluster"
      + id               = (known after apply)
      + name             = "demo-eks-cluster-cert-manager-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "route53:GetChange"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:route53:::change/*"
                    },
                  + {
                      + Action   = [
                          + "route53:ChangeResourceRecordSets",
                          + "route53:ListResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:route53:::hostedzone/Z091966067WXBVR2EU8U"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy"      = "Terraform"
          + "Environment"     = "Development"
          + "OwnerEmail"      = "devops@example.com"
          + "Team"            = "DevOps"
          + "TerminationDate" = "Permanent"
        }
    }

  # module.irsa_cert_manager.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/9AD4B3D82B4B0B91991A3CF4B9B9008B:sub" = "system:serviceaccount:cert-manager:cert-manager-route53"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::975050034278:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/9AD4B3D82B4B0B91991A3CF4B9B9008B"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo-eks-cluster-cert-manager-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy"      = "Terraform"
          + "Environment"     = "Development"
          + "OwnerEmail"      = "devops@example.com"
          + "Team"            = "DevOps"
          + "TerminationDate" = "Permanent"
        }
      + unique_id             = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.irsa_cert_manager.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "demo-eks-cluster-cert-manager-role"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

Results for commit: 7641b056a30c988034c56ecff7ed74b03273f71f

*Pusher: @liubenok, Action: `pull_request`, Working Directory: `aws/infrastructure-by-single-command`, Workflow: `Terraform CI/CD infrastructure EKS`*